import xueziLayout from '/src/assets/xuezi.webp';

export const stationMap = {
  '清水河学知苑1号充电桩': {
    location: '学知苑二组团对面',
    lat: 30.754285,
    lon: 103.932587,
    layout: {
      imageUrl: '/layouts/8-outlets-2x4.png',
      width: 400,
      height: 200,
      outletPositions: [
        { index: 0, x: 50, y: 50 }, { index: 1, x: 125, y: 50 }, { index: 2, x: 200, y: 50 }, { index: 3, x: 275, y: 50 },
        { index: 4, x: 50, y: 150 }, { index: 5, x: 125, y: 150 }, { index: 6, x: 200, y: 150 }, { index: 7, x: 275, y: 150 }
      ]
    },
    outlets: [
      { id: "O211127011407957", name: "1-1" },
      { id: "O211127011408968", name: "1-2" },
      { id: "O211127011409978", name: "1-3" },
      { id: "O211127011410988", name: "1-4" },
      { id: "O211127011411999", name: "1-5" },
      { id: "O211127011412009", name: "1-6" },
      { id: "O211127011413019", name: "1-7" },
      { id: "O211127011414029", name: "1-8" }
    ]
  },
  '清水河学知苑2号充电桩': {
    location: '学知苑二组团对面',
    lat: 30.754285,
    lon: 103.932587,
    layout: {
      imageUrl: '/layouts/8-outlets-2x4.png',
      width: 400,
      height: 200,
      outletPositions: [
        { index: 0, x: 50, y: 50 }, { index: 1, x: 125, y: 50 }, { index: 2, x: 200, y: 50 }, { index: 3, x: 275, y: 50 },
        { index: 4, x: 50, y: 150 }, { index: 5, x: 125, y: 150 }, { index: 6, x: 200, y: 150 }, { index: 7, x: 275, y: 150 }
      ]
    },
    outlets: [
      { id: "O2403252e2a0d3a8", name: "2-1" },
      { id: "O2403252e2a0e226", name: "2-2" },
      { id: "O2403252e2a0f1c3", name: "2-3" },
      { id: "O2403252e2a10373", name: "2-4" },
      { id: "O2403252e2a11033", name: "2-5" },
      { id: "O2403252e2a120ae", name: "2-6" },
      { id: "O2403252e2a132c2", name: "2-7" },
      { id: "O2403252e2a14241", name: "2-8" }
    ]
  },
  '清水河学知苑3号充电桩': {
    location: '学知苑二组团对面',
    lat: 30.754285,
    lon: 103.932587,
    layout: {
      imageUrl: '/layouts/8-outlets-2x4.png',
      width: 400,
      height: 200,
      outletPositions: [
        { index: 0, x: 50, y: 50 }, { index: 1, x: 125, y: 50 }, { index: 2, x: 200, y: 50 }, { index: 3, x: 275, y: 50 },
        { index: 4, x: 50, y: 150 }, { index: 5, x: 125, y: 150 }, { index: 6, x: 200, y: 150 }, { index: 7, x: 275, y: 150 }
      ]
    },
    outlets: [
      { id: "O2403252e28211df", name: "3-1" },
      { id: "O2403252e28222de", name: "3-2" },
      { id: "O2403252e282314b", name: "3-3" },
      { id: "O2403252e2824294", name: "3-4" },
      { id: "O2403252e2825218", name: "3-5" },
      { id: "O2403252e28262aa", name: "3-6" },
      { id: "O2403252e2827259", name: "3-7" },
      { id: "O2403252e282807d", name: "3-8" }
    ]
  },
  '清水河学知苑4号充电桩': {
    location: '学知苑二组团对面',
    lat: 30.754285,
    lon: 103.932587,
    layout: {
      imageUrl: '/layouts/4-outlets-1x4.png',
      width: 400,
      height: 100,
      outletPositions: [
        { index: 0, x: 50, y: 50 }, { index: 1, x: 125, y: 50 }, { index: 2, x: 200, y: 50 }, { index: 3, x: 275, y: 50 }
      ]
    },
    outlets: [
      { id: "O230710283f0e025", name: "4-1" },
      { id: "O230710283f0f202", name: "4-2" },
      { id: "O230710283f1400d", name: "4-3" },
      { id: "O230710283f1513f", name: "4-4" }
    ]
  },
  '学子餐厅东': {
    location: '电子科大清水河校区学子餐厅1~5号电站',
    lat: 30.752637,
    lon: 103.934723,
    layout: {
      imageUrl: xueziLayout,
      width: 221,
      height: 437,
      outletPositions: [
        { index: 0, x: 149, y: 83 }, { index: 1, x: 141, y: 71 }, { index: 2, x: 136, y: 63 }, { index: 3, x: 129, y: 53 },
        { index: 4, x: 124, y: 46 }, { index: 5, x: 116, y: 36 }, { index: 6, x: 109, y: 27 }, { index: 7, x: 103, y: 16 },
        { index: 0, x: 184, y: 167 }, { index: 1, x: 180, y: 157 }, { index: 2, x: 177, y: 148 }, { index: 3, x: 172, y: 136 },
        { index: 4, x: 168, y: 125 }, { index: 5, x: 165, y: 115 }, { index: 6, x: 162, y: 104 }, { index: 7, x: 157, y: 95 },
        { index: 0, x: 183, y: 184 }, { index: 1, x: 182, y: 195 }, { index: 2, x: 179, y: 206 }, { index: 3, x: 175, y: 217 },
        { index: 4, x: 173, y: 229 }, { index: 5, x: 172, y: 239 }, { index: 6, x: 169, y: 249 }, { index: 7, x: 167, y: 261 },
        { index: 0, x: 157, y: 276 }, { index: 1, x: 152, y: 285 }, { index: 2, x: 145, y: 291 }, { index: 3, x: 138, y: 303 },
        { index: 4, x: 129, y: 313 }, { index: 5, x: 125, y: 319 }, { index: 6, x: 118, y: 330 }, { index: 7, x: 109, y: 339 },
        { index: 0, x: 55, y: 416 }, { index: 1, x: 60, y: 405 }, { index: 2, x: 68, y: 394 }, { index: 3, x: 74, y: 385 },
        { index: 4, x: 83, y: 376 }, { index: 5, x: 86, y: 370 }, { index: 6, x: 95, y: 359 }, { index: 7, x: 101, y: 350 }
      ]
    },
    outlets: [
      { id: "O201222013853574", name: "1-1" },
      { id: "O201222013854585", name: "1-2" },
      { id: "O201222013855595", name: "1-3" },
      { id: "O201222013856605", name: "1-4" },
      { id: "O201222013857615", name: "1-5" },
      { id: "O201222013858626", name: "1-6" },
      { id: "O201222013859636", name: "1-7" },
      { id: "O201222013860646", name: "1-8" },
      { id: "O200604010216599", name: "2-1" },
      { id: "O200604010217610", name: "2-2" },
      { id: "O200604010218623", name: "2-3" },
      { id: "O200604010219634", name: "2-4" },
      { id: "O200604010220646", name: "2-5" },
      { id: "O200604010221658", name: "2-6" },
      { id: "O200604010222670", name: "2-7" },
      { id: "O200604010223682", name: "2-8" },
      { id: "O2403252e2ac1369", name: "3-1" },
      { id: "O2403252e2ac216e", name: "3-2" },
      { id: "O2403252e2ac316f", name: "3-3" },
      { id: "O2403252e2ac4302", name: "3-4" },
      { id: "O2403252e2ac5033", name: "3-5" },
      { id: "O2403252e2ac6329", name: "3-6" },
      { id: "O2403252e2ac717e", name: "3-7" },
      { id: "O2403252e2ac8377", name: "3-8" },
      { id: "O201120012018307", name: "4-1" },
      { id: "O201120012019317", name: "4-2" },
      { id: "O201120012020328", name: "4-3" },
      { id: "O201120012021339", name: "4-4" },
      { id: "O201120012022349", name: "4-5" },
      { id: "O201120012023359", name: "4-6" },
      { id: "O201120012024369", name: "4-7" },
      { id: "O201120012025379", name: "4-8" },
      { id: "O210520019380658", name: "5-1" },
      { id: "O210520019381669", name: "5-2" },
      { id: "O210520019382679", name: "5-3" },
      { id: "O210520019383689", name: "5-4" },
      { id: "O210520019384699", name: "5-5" },
      { id: "O210520019385710", name: "5-6" },
      { id: "O210520019386720", name: "5-7" },
      { id: "O210520019387730", name: "5-8" }
    ]
  },
  '学子餐厅西': {
    location: '电子科大清水河校区学子餐厅6~9号充电桩',
    lat: 30.752637,
    lon: 103.934723,
    layout: {
      imageUrl: xueziLayout,
      width: 221,
      height: 437,
      outletPositions: [
        { index: 0, x: 65, y: 69 }, { index: 1, x: 72, y: 79 }, { index: 2, x: 79, y: 91 }, { index: 3, x: 86, y: 98 },
        { index: 4, x: 90, y: 108 }, { index: 5, x: 96, y: 116 }, { index: 6, x: 102, y: 128 }, { index: 7, x: 108, y: 138 },
        { index: 0, x: 114, y: 152 }, { index: 1, x: 117, y: 161 }, { index: 2, x: 118, y: 174 }, { index: 3, x: 120, y: 186 },
        { index: 4, x: 120, y: 196 }, { index: 5, x: 122, y: 206 }, { index: 6, x: 123, y: 218 }, { index: 7, x: 123, y: 226 },
        { index: 0, x: 122, y: 250 }, { index: 1, x: 114, y: 259 }, { index: 2, x: 108, y: 268 }, { index: 3, x: 100, y: 278 },
        { index: 4, x: 92, y: 286 }, { index: 5, x: 87, y: 295 }, { index: 6, x: 79, y: 303 }, { index: 7, x: 73, y: 313 },
        { index: 0, x: 63, y: 324 }, { index: 1, x: 58, y: 331 }, { index: 2, x: 52, y: 340 }, { index: 3, x: 42, y: 350 },
        { index: 4, x: 36, y: 360 }, { index: 5, x: 30, y: 368 }, { index: 6, x: 23, y: 378 }, { index: 7, x: 18, y: 386 }
      ]
    },
    outlets: [
      { id: "O210701014923058", name: "6-1" },
      { id: "O210701014924080", name: "6-2" },
      { id: "O210701014925105", name: "6-3" },
      { id: "O210701014926124", name: "6-4" },
      { id: "O210701014927173", name: "6-5" },
      { id: "O210701014928202", name: "6-6" },
      { id: "O210701014929218", name: "6-7" },
      { id: "O210701014930232", name: "6-8" },
      { id: "O210702016467798", name: "7-1" },
      { id: "O210702016468808", name: "7-2" },
      { id: "O210702016469818", name: "7-3" },
      { id: "O210702016470832", name: "7-4" },
      { id: "O210702016471843", name: "7-5" },
      { id: "O210702016472853", name: "7-6" },
      { id: "O210702016473863", name: "7-7" },
      { id: "O210702016474873", name: "7-8" },
      { id: "O210702016485802", name: "8-1" },
      { id: "O210702016486812", name: "8-2" },
      { id: "O210702016487823", name: "8-3" },
      { id: "O210702016488834", name: "8-4" },
      { id: "O210702016489844", name: "8-5" },
      { id: "O210702016490854", name: "8-6" },
      { id: "O210702016491864", name: "8-7" },
      { id: "O210702016492874", name: "8-8" },
      { id: "O210520019362665", name: "9-1" },
      { id: "O210520019363675", name: "9-2" },
      { id: "O210520019364684", name: "9-3" },
      { id: "O210520019365694", name: "9-4" },
      { id: "O210520019366704", name: "9-5" },
      { id: "O210520019367713", name: "9-6" },
      { id: "O210520019368723", name: "9-7" },
      { id: "O210520019369733", name: "9-8" }
    ]
  },
};
